bender2333/x-protocal/Third_Party/GD32F/gd32-secure-boot-secure-firmware-update/Utilities/Third_Party/mbedtls-2.17.0/library/ecp.c
    return( mbedtls_ecp_gen_keypair_base( grp, &grp->G, d, Q, f_rng, p_rng ) );
}

/*
 * Generate a keypair, prettier wrapper
 */
int mbedtls_ecp_gen_key( mbedtls_ecp_group_id grp_id, mbedtls_ecp_keypair *key,
                int (*f_rng)(void *, unsigned char *, size_t), void *p_rng )
{
    int ret;
    ECP_VALIDATE_RET( key   != NULL );
    ECP_VALIDATE_RET( f_rng != NULL );

    if( ( ret = mbedtls_ecp_group_load( &key->grp, grp_id ) ) != 0 )
        return( ret );

    return( mbedtls_ecp_gen_keypair( &key->grp, &key->d, &key->Q, f_rng, p_rng ) );
}

/*
 * Check a public-private key pair
 */
int mbedtls_ecp_check_pub_priv( const mbedtls_ecp_keypair *pub, const mbedtls_ecp_keypair *prv )
{
    int ret;
    mbedtls_ecp_point Q;
    mbedtls_ecp_group grp;
    ECP_VALIDATE_RET( pub != NULL );
    ECP_VALIDATE_RET( prv != NULL );

    if( pub->grp.id == MBEDTLS_ECP_DP_NONE ||
        pub->grp.id != prv->grp.id ||
        mbedtls_mpi_cmp_mpi( &pub->Q.X, &prv->Q.X ) ||
        mbedtls_mpi_cmp_mpi( &pub->Q.Y, &prv->Q.Y ) ||
        mbedtls_mpi_cmp_mpi( &pub->Q.Z, &prv->Q.Z ) )
    {
        return( MBEDTLS_ERR_ECP_BAD_INPUT_DATA );
    }

    mbedtls_ecp_point_init( &Q );
    mbedtls_ecp_group_init( &grp );

    /* mbedtls_ecp_mul() needs a non-const group... */
    mbedtls_ecp_group_copy( &grp, &prv->grp );

    /* Also checks d is valid */
    MBEDTLS_MPI_CHK( mbedtls_ecp_mul( &grp, &Q, &prv->d, &prv->grp.G, NULL, NULL ) );

    if( mbedtls_mpi_cmp_mpi( &Q.X, &prv->Q.X ) ||
        mbedtls_mpi_cmp_mpi( &Q.Y, &prv->Q.Y ) ||
        mbedtls_mpi_cmp_mpi( &Q.Z, &prv->Q.Z ) )
    {
        ret = MBEDTLS_ERR_ECP_BAD_INPUT_DATA;
        goto cleanup;
    }

cleanup:
    mbedtls_ecp_point_free( &Q );
    mbedtls_ecp_group_free( &grp );

    return( ret );
}

#ifdef CONFIG_HW_SECURITY_ENGINE
int pka_group_init_with_grp(pkcau_ec_group_parameter_struct *pka_grp, const mbedtls_ecp_group *grp)
{
    int ret = 0;

    mbedtls_platform_zeroize(pka_grp, sizeof(pkcau_ec_group_parameter_struct));

    pka_grp->modulus_p = (uint8_t *)grp->P.p;
    pka_grp->modulus_p_len = mbedtls_mpi_size(&grp->P);

    if (grp->A.p == NULL)
    {
        /* NIST prime curves: A coef = -3 */
        pka_grp->coff_a_len = 1;
        pka_grp->coff_a = mbedtls_calloc(pka_grp->coff_a_len, sizeof( uint8_t ));
        MBEDTLS_MPI_CHK((pka_grp->coff_a == NULL) ? MBEDTLS_ERR_ECP_ALLOC_FAILED : 0);
        pka_grp->coff_a[0] = 3U;
        /* For HW, sign is 1 for negative value and 0 for positive value */
        pka_grp->a_sign = 1U;
    }
    else
    {
        /* Other curves: A coef is positive */
        pka_grp->coff_a = (uint8_t *)grp->A.p;
        pka_grp->coff_a_len = mbedtls_mpi_size(&grp->A);
        pka_grp->a_sign = 0;
    }

    pka_grp->coff_b = (uint8_t *)grp->B.p;
    pka_grp->coff_b_len = mbedtls_mpi_size(&grp->B);

    pka_grp->base_point_x = (uint8_t *)grp->G.X.p;
    pka_grp->base_point_x_len = mbedtls_mpi_size(&grp->G.X);

    pka_grp->base_point_y = (uint8_t *)grp->G.Y.p;
    pka_grp->base_point_y_len = mbedtls_mpi_size(&grp->G.Y);

    pka_grp->order_n = (uint8_t *)grp->N.p;
    pka_grp->order_n_len = mbedtls_mpi_size(&grp->N);

cleanup:
    if (ret != 0)
        pka_group_free(pka_grp);
    return ret;
}

void pka_group_free(pkcau_ec_group_parameter_struct *pka_grp)
{
    if (pka_grp->a_sign) {
        mbedtls_platform_zeroize(pka_grp->coff_a, pka_grp->coff_a_len);
        mbedtls_free(pka_grp->coff_a);
    }
}
#endif

#if defined(MBEDTLS_SELF_TEST)

/*
 * Checkup routine
 */
int mbedtls_ecp_self_test( int verbose )
{
    int ret;
    size_t i;
    mbedtls_ecp_group grp;
    mbedtls_ecp_point R, P;
    mbedtls_mpi m;
    unsigned int nb_curves = 0, group_id;
    unsigned long add_c_prev, dbl_c_prev, mul_c_prev;
    /* exponents especially adapted for secp192r1 */
    const char *exponents[] =
    {
        "000000000000000000000000000000000000000000000001", /* one */
        //"FFFFFFFFFFFFFFFFFFFFFFFF99DEF836146BC9B1B4D22830", /* N - 1 */
        "FFFFFFFFFFFFFFFFFFFFFFFE26F2FC170F69466A74DEFD8C", /* N - 1 */ /* secp192k1 */
        "5EA6F389A38B8BC81E767753B15AA5569E1782E30ABE7D25", /* random */
        "400000000000000000000000000000000000000000000000", /* one and zeros */
        "7FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF", /* all ones */
        "555555555555555555555555555555555555555555555555", /* 101010... */
    };

    mbedtls_ecp_group_init( &grp );
    mbedtls_ecp_point_init( &R );
    mbedtls_ecp_point_init( &P );
    mbedtls_mpi_init( &m );

NextCurve:
    if ( nb_curves >= (ECP_NB_CURVES - 1) ) {
        goto cleanup;
    } else {
        mbedtls_ecp_group_free( &grp );
        mbedtls_ecp_point_free( &R );
        mbedtls_ecp_point_free( &P );
        mbedtls_mpi_free( &m );
        mbedtls_ecp_group_init( &grp );
        mbedtls_ecp_point_init( &R );
        mbedtls_ecp_point_init( &P );
        mbedtls_mpi_init( &m );
    }

    if( verbose != 0 )
        mbedtls_printf( "  ====== ECC Group[%d] %s ====== \r\n", nb_curves, ecp_supported_curves[nb_curves].name);
    group_id = ecp_supported_curves[nb_curves].grp_id;
    MBEDTLS_MPI_CHK( mbedtls_ecp_group_load( &grp, group_id ) );

#if 0
    /* Use secp192r1 if available, or any available curve */
#if defined(MBEDTLS_ECP_DP_SECP192R1_ENABLED)
    MBEDTLS_MPI_CHK( mbedtls_ecp_group_load( &grp, MBEDTLS_ECP_DP_SECP192R1 ) );
#else
    MBEDTLS_MPI_CHK( mbedtls_ecp_group_load( &grp, mbedtls_ecp_curve_list()->grp_id ) );
#endif
#endif
    if( verbose != 0 )
        mbedtls_printf( "  ECP test #1 (constant op_count, base point G): \r\n" );

    /* Do a dummy multiplication first to trigger precomputation */
    MBEDTLS_MPI_CHK( mbedtls_mpi_lset( &m, 2 ) );
    MBEDTLS_MPI_CHK( mbedtls_ecp_mul( &grp, &P, &m, &grp.G, NULL, NULL ) );

    add_count = 0;
    dbl_count = 0;
    mul_count = 0;
    MBEDTLS_MPI_CHK( mbedtls_mpi_read_string( &m, 16, exponents[0] ) );
    MBEDTLS_MPI_CHK( mbedtls_ecp_mul( &grp, &R, &m, &grp.G, NULL, NULL ) );

    for( i = 1; i < sizeof( exponents ) / sizeof( exponents[0] ); i++ )
    {
        add_c_prev = add_count;
        dbl_c_prev = dbl_count;
        mul_c_prev = mul_count;
        add_count = 0;
        dbl_count = 0;
        mul_count = 0;

        MBEDTLS_MPI_CHK( mbedtls_mpi_read_string( &m, 16, exponents[i] ) );
        MBEDTLS_MPI_CHK( mbedtls_ecp_mul( &grp, &R, &m, &grp.G, NULL, NULL ) );

        if( add_count != add_c_prev ||
            dbl_count != dbl_c_prev ||
            mul_count != mul_c_prev )
        {
            if( verbose != 0 )
                mbedtls_printf( "failed (%u)\n", (unsigned int) i );

            ret = 1;
            goto cleanup;
        }
    }

